testing freelance projects/lemo project/JMeter_Multi_Users_TestPlan/aggregate.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
Home Page,50,3174,3002,4499,4863,5643,1233,5643,0.000%,3.23625,3.40,0.37
login ,1,3364,3364,3364,3364,3364,3364,3364,0.000%,.29727,0.31,0.04
Bank Login Page,3,2844,2524,3504,3504,3504,2505,3504,0.000%,.66298,0.70,0.08
Admin Dashboard,2,3331,2624,4038,4038,4038,2624,4038,0.000%,.49529,0.52,0.06
icon for money request ,50,963,996,1684,1883,1959,210,1959,0.000%,3.83789,4.03,0.48
dashboard of lemo employee,1,1051,1051,1051,1051,1051,1051,1051,0.000%,.95147,1.00,0.12
Products,3,758,994,1000,1000,1000,281,1000,0.000%,2.30415,2.42,0.28
Account management,2,709,522,896,896,896,522,896,0.000%,2.13904,2.25,0.26
down icon_for report,50,898,758,1732,1774,2028,212,2028,0.000%,3.99457,4.20,0.51
study request ,1,284,284,284,284,284,284,284,0.000%,3.52113,3.70,0.45
Agency(hone page),3,259,280,280,280,280,217,280,0.000%,5.81395,6.11,0.70
Control pages inside ,2,269,259,280,280,280,259,280,0.000%,6.71141,7.05,0.82
Request for money ,50,890,781,1687,1695,1868,194,1868,0.000%,3.73552,3.93,0.46
study request 1 as example,1,229,229,229,229,229,229,229,0.000%,4.36681,4.59,0.72
Unprocessed request,3,226,226,227,227,227,226,227,0.000%,6.56455,6.90,0.83
Request Status Admin,2,222,219,225,225,225,219,225,0.000%,8.43882,8.87,1.15
user details,50,785,687,1598,1687,1907,205,1907,0.000%,3.72162,3.91,0.45
request 1 study _case:: pass,1,227,227,227,227,227,227,227,0.000%,4.40529,4.63,0.57
Approved request,3,377,225,686,686,686,222,686,0.000%,3.27869,3.45,0.40
Lemo report request ,50,819,687,1684,1722,1764,195,1764,0.000%,3.71140,3.90,0.47
Finance Branch,2,223,219,228,228,228,219,228,0.000%,8.77193,9.22,1.07
,2,0,0,0,0,0,0,0,100.000%,∞,0.00,0.00
Request Status _page 1,1,661,661,661,661,661,661,661,0.000%,1.51286,1.59,0.21
Rejected request,3,777,722,929,929,929,682,929,0.000%,1.83824,1.93,0.23
Dashboard,50,938,885,1716,1803,2031,205,2031,0.000%,3.71250,3.90,0.46
Request status_Page 2,1,747,747,747,747,747,747,747,0.000%,1.33869,1.41,0.18
Bank settings,3,1372,1420,1869,1869,1869,829,1869,0.000%,1.06458,1.12,0.14
Support messages_calls,1,1919,1919,1919,1919,1919,1919,1919,0.000%,.52110,0.55,0.06
TOTAL,391,1180,926,2485,3762,4559,0,5643,0.512%,20.84444,21.88,2.56