testing freelance projects/lemo project/JMeter_Multi_Users_TestPlan/summary.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
Home Page,50,3174,1233,5643,1187.58,0.000%,3.23625,3.40,0.37,1076.0
login ,1,3364,3364,3364,0.00,0.000%,.29727,0.31,0.04,1076.0
Bank Login Page,3,2844,2505,3504,466.52,0.000%,.66298,0.70,0.08,1076.0
Admin Dashboard,2,3331,2624,4038,707.00,0.000%,.49529,0.52,0.06,1076.0
icon for money request ,50,963,210,1959,521.20,0.000%,3.83789,4.03,0.48,1076.0
dashboard of lemo employee,1,1051,1051,1051,0.00,0.000%,.95147,1.00,0.12,1076.0
Products,3,758,281,1000,337.53,0.000%,2.30415,2.42,0.28,1076.0
Account management,2,709,522,896,187.00,0.000%,2.13904,2.25,0.26,1076.0
down icon_for report,50,898,212,2028,594.99,0.000%,3.99457,4.20,0.51,1076.0
study request ,1,284,284,284,0.00,0.000%,3.52113,3.70,0.45,1076.0
Agency(hone page),3,259,217,280,29.70,0.000%,5.81395,6.11,0.70,1076.0
Control pages inside ,2,269,259,280,10.50,0.000%,6.71141,7.05,0.82,1076.0
Request for money ,50,890,194,1868,599.17,0.000%,3.73552,3.93,0.46,1076.0
study request 1 as example,1,229,229,229,0.00,0.000%,4.36681,4.59,0.72,1076.0
Unprocessed request,3,226,226,227,0.47,0.000%,6.56455,6.90,0.83,1076.0
Request Status Admin,2,222,219,225,3.00,0.000%,8.43882,8.87,1.15,1076.0
user details,50,785,205,1907,558.72,0.000%,3.72162,3.91,0.45,1076.0
request 1 study _case:: pass,1,227,227,227,0.00,0.000%,4.40529,4.63,0.57,1076.0
Approved request,3,377,222,686,218.03,0.000%,3.27869,3.45,0.40,1076.0
Lemo report request ,50,819,195,1764,516.41,0.000%,3.71140,3.90,0.47,1076.0
Finance Branch,2,223,219,228,4.50,0.000%,8.77193,9.22,1.07,1076.0
,2,0,0,0,0.00,100.000%,.00000,0.00,0.00,862.0
Request Status _page 1,1,661,661,661,0.00,0.000%,1.51286,1.59,0.21,1076.0
Rejected request,3,777,682,929,108.25,0.000%,1.83824,1.93,0.23,1076.0
Dashboard,50,938,205,2031,549.97,0.000%,3.71250,3.90,0.46,1076.0
Request status_Page 2,1,747,747,747,0.00,0.000%,1.33869,1.41,0.18,1076.0
Bank settings,3,1372,829,1869,425.90,0.000%,1.06458,1.12,0.14,1076.0
Support messages_calls,1,1919,1919,1919,0.00,0.000%,.52110,0.55,0.06,1076.0
TOTAL,391,1180,0,5643,1056.09,0.512%,20.84444,21.88,2.56,1074.9